Repository: Policy56/Hexagonal-sliding-puzzle
Catalog: lib/l10n/arb/app_*.arb
Languages: fr

# puzzleChallengeTitle
source: Hexagonal Slide Puzzle
fr: Hexagonal Sliding Puzzle

# puzzleNumberOfMoves
source: Moves
fr: Mouvements

# puzzleNumberOfTilesLeft
source: Tiles remaining
fr: Blocs restants

# successCompleted
source: Hexagonal Sliding Puzzle completed
fr: Hexagonal Sliding Puzzle terminé

# successWellDone
source: Well done. Congrats!
fr: Bien joué. Félicitations !

# successNumberOfMoves
source: {numberOfMoves} Moves
fr: {numberOfMoves} Mouvements

# puzzleDurationLabelText
source: {hours} hours {minutes} minutes {seconds} seconds
fr: {hours} heures {minutes} minutes {seconds} seconds

# puzzleSwitchTooltip
source: Toggle on to highlight the correct positionned tiles.
fr: Activer pour afficher les blocs bien placés.

# puzzleStart
source: Start game
fr: Commencer

# puzzleShuffle
source: Shuffle
fr: Mélanger

# puzzleCompleted
source: Well done. Congrats!
fr: Bien joué. Félicitations!

# successShareYourScoreTitle
source: Share your score!
fr: Partager votre score!

# successShareYourScoreMessage
source: Share this puzzle to challenge your friends and be sure to check out the Flutter Puzzle Hack.
fr: Partager ce jeu pour challenger vos amis.

# successShareText
source: Just solved the #HexagonalSlidingPuzzle ! Check it out â†“
fr: Je viens de terminer le #HexagonalSlidingPuzzle en {numberOfMoves} mouvements ! Joue ici ↓
